//Что такое tree shaking, зачем pure, когда ломается
//Замена названия файла на index.tsx в компонентах. Можно ли хранить для других файлов
//Нужно ли указывать в zod пустое значение, если в компоненте стоит защита от дурака в лице value=''
//displayName только под форвардРеф? Обычной пагинации без форвардРефа можно не задавать выходит?
//если в дропдауне замутить проверку по displayName на Avatar и выдавать другой компонент,стоит ли лезть, принимать массив с объектами с полем контент
//вопрос по типизации кнопки, почему работает через infer, а при экспорте при тайп кастинге ElementRef хватает
